## Функции обработки возможных ошибок при вводе слова
#
#  Проверяет корректность вводимой пары слов в режиме "Добавить слова"
#  @file errors.py
#  @author Есаулов Лев

## Функция проверки корректности ввода
#
#  Проверяет корректность вводимой пары слов в режиме "Добавить слова"
#  @param text Пара слов введенная пользователем
def word_order(text):
    place = text.find(".")
    if place == -1:
        return 0
    elif not (65 <= int(ord(text[place - 1])) <= 122 and
              (1040 <= int(ord(text[place + 1])) <= 1103 or text[place + 1] == ' ')):
        return 0
    else:
        return 1
