## Функции обработки возможных ошибок при вводе слова
#
#  Проверяет корректность вводимой пары слов в режиме "Добавить слова"
#  @file errors.py
#  @author Есаулов Лев

## Функция проверки корректности ввода
#
#  Проверяет корректность вводимой пары слов в режиме "Добавить слова"
#  @param text Пара слов введенная пользователем
def word_order(text):
    place = text.find(".")
    if place == -1:
        return 0
    elif not (65 <= int(ord(text[place - 1])) <= 122 and
              (1040 <= int(ord(text[place + 1])) <= 1103 or text[place + 1] == ' ')):
        return 0
    else:
        return 1


## Функция отсекания слова и преобразование его в нижний регистр
#
#  Берет английскую часть строки и преобразует в нижний регистр
#  @param text Пара слов введенная пользователем
#  @return Добавляет слова в безу данных
def change_word(text):
    text = text.partition('.')[0]
    small = text.lower().replace(" ", "")
    return small
